Results/ReplicaCountAndLatency/yeast/ArangoDB/1.txt
/usr/bin/java  -classpath /home/ayush/work/GRACEBenchmarks/YCSB/conf:/home/ayush/work/GRACEBenchmarks/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/arangodb-binding-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/HdrHistogram-2.1.12.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/arangodb-java-driver-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/core-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/http-protocol-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-annotations-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-core-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-core-asl-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-databind-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-datatype-jakarta-jsonp-2.19.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jackson-serde-json-7.22.0.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/jakarta.json-api-2.1.3.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-buffer-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-dns-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-http-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-http2-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-codec-socks-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-common-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-handler-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-handler-proxy-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-resolver-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-resolver-dns-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-transport-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/slf4j-api-1.7.25.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-auth-common-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-core-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-uri-template-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-web-client-4.5.7.jar:/home/ayush/work/GRACEBenchmarks/YCSB/arangodb/target/dependency/vertx-web-common-4.5.7.jar site.ycsb.Client -t -db site.ycsb.db.ArangoDBClient -P workloads/workload_grace -p DBTYPE=arangodb -p DBURI=http://localhost:8529 -p REPLICATION_FACTOR=1 -p maxexecutiontime=60 -p threadcount=1 -p loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_load_vertices.json -p loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_load_edges.json -p vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_update_vertices.json -p edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_update_edges.json
Loaded 1867 vertices and 7737 edges
Initializing db: site.ycsb.db.ArangoDBClient
Using Database: site.ycsb.DBWrapper
Starting ArangoDB client
{deleteproportion=1, loadEdgeFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_load_edges.json, recordcount=10000, operationcount=20000000, loadVertexFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_load_vertices.json, edgeAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_update_edges.json, readproportion=1, workload=site.ycsb.workloads.CoreWorkload, threadcount=1, updateproportion=1, DBTYPE=arangodb, dotransactions=true, createproportion=1, REPLICATION_FACTOR=1, DBURI=http://localhost:8529, maxexecutiontime=60, vertexAddFile=/home/ayush/work/GRACEBenchmarks/GraphDBData/yeast_update_vertices.json, readallfields=true, db=site.ycsb.db.ArangoDBClient, requestdistribution=latest}
DBTYPE: arangodb
DBURI: http://localhost:8529
Connecting to ArangoDB database with params: localhost:8529
ArangoDB client initialized successfully
Connected to ArangoDB database successfully
[OVERALL], RunTime(ms), 60003
[OVERALL], Throughput(ops/sec), 220.8889555522224
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 192
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.31998400079996
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 192
[TOTAL_GC_TIME_%], Time(%), 0.31998400079996
[REMOVE_VERTEX], Operations, 494
[REMOVE_VERTEX], AverageLatency(us), 1206.3765182186235
[REMOVE_VERTEX], MinLatency(us), 629
[REMOVE_VERTEX], MaxLatency(us), 50495
[REMOVE_VERTEX], 50thPercentileLatency(us), 857
[REMOVE_VERTEX], 95thPercentileLatency(us), 2131
[REMOVE_VERTEX], 99thPercentileLatency(us), 4179
[REMOVE_VERTEX], Return=OK, 494
[GET_EDGE_WITH_PROPERTY], Operations, 1011
[GET_EDGE_WITH_PROPERTY], AverageLatency(us), 1429.5004945598419
[GET_EDGE_WITH_PROPERTY], MinLatency(us), 890
[GET_EDGE_WITH_PROPERTY], MaxLatency(us), 7779
[GET_EDGE_WITH_PROPERTY], 50thPercentileLatency(us), 1277
[GET_EDGE_WITH_PROPERTY], 95thPercentileLatency(us), 2165
[GET_EDGE_WITH_PROPERTY], 99thPercentileLatency(us), 4423
[GET_EDGE_WITH_PROPERTY], Return=OK, 1011
[ADD_EDGE], Operations, 954
[ADD_EDGE], AverageLatency(us), 1756.7893081761006
[ADD_EDGE], MinLatency(us), 563
[ADD_EDGE], MaxLatency(us), 273919
[ADD_EDGE], 50thPercentileLatency(us), 1020
[ADD_EDGE], 95thPercentileLatency(us), 2123
[ADD_EDGE], 99thPercentileLatency(us), 6463
[ADD_EDGE], Return=OK, 954
[GET_VERTEX_WITH_PROPERTY], Operations, 922
[GET_VERTEX_WITH_PROPERTY], AverageLatency(us), 1579.909978308026
[GET_VERTEX_WITH_PROPERTY], MinLatency(us), 870
[GET_VERTEX_WITH_PROPERTY], MaxLatency(us), 43167
[GET_VERTEX_WITH_PROPERTY], 50thPercentileLatency(us), 1233
[GET_VERTEX_WITH_PROPERTY], 95thPercentileLatency(us), 2151
[GET_VERTEX_WITH_PROPERTY], 99thPercentileLatency(us), 5019
[GET_VERTEX_WITH_PROPERTY], Return=OK, 922
[ADD_VERTEX], Operations, 494
[ADD_VERTEX], AverageLatency(us), 1108.4817813765183
[ADD_VERTEX], MinLatency(us), 647
[ADD_VERTEX], MaxLatency(us), 4975
[ADD_VERTEX], 50thPercentileLatency(us), 914
[ADD_VERTEX], 95thPercentileLatency(us), 2381
[ADD_VERTEX], 99thPercentileLatency(us), 4077
[ADD_VERTEX], Return=OK, 494
[REMOVE_EDGE], Operations, 924
[REMOVE_EDGE], AverageLatency(us), 1306.6536796536795
[REMOVE_EDGE], MinLatency(us), 685
[REMOVE_EDGE], MaxLatency(us), 58719
[REMOVE_EDGE], 50thPercentileLatency(us), 1005
[REMOVE_EDGE], 95thPercentileLatency(us), 1857
[REMOVE_EDGE], 99thPercentileLatency(us), 4211
[REMOVE_EDGE], Return=OK, 924
[REMOVE_EDGE_PROPERTY], Operations, 963
[REMOVE_EDGE_PROPERTY], AverageLatency(us), 2382.103842159917
[REMOVE_EDGE_PROPERTY], MinLatency(us), 1260
[REMOVE_EDGE_PROPERTY], MaxLatency(us), 45375
[REMOVE_EDGE_PROPERTY], 50thPercentileLatency(us), 1827
[REMOVE_EDGE_PROPERTY], 95thPercentileLatency(us), 3071
[REMOVE_EDGE_PROPERTY], 99thPercentileLatency(us), 9975
[REMOVE_EDGE_PROPERTY], Return=OK, 963
[GET_EDGE_LABELS], Operations, 969
[GET_EDGE_LABELS], AverageLatency(us), 33900.714138286894
[GET_EDGE_LABELS], MinLatency(us), 23392
[GET_EDGE_LABELS], MaxLatency(us), 159615
[GET_EDGE_LABELS], 50thPercentileLatency(us), 32703
[GET_EDGE_LABELS], 95thPercentileLatency(us), 38527
[GET_EDGE_LABELS], 99thPercentileLatency(us), 53215
[GET_EDGE_LABELS], Return=OK, 969
[GET_VERTEX_COUNT], Operations, 946
[GET_VERTEX_COUNT], AverageLatency(us), 982.1427061310782
[GET_VERTEX_COUNT], MinLatency(us), 556
[GET_VERTEX_COUNT], MaxLatency(us), 25663
[GET_VERTEX_COUNT], 50thPercentileLatency(us), 825
[GET_VERTEX_COUNT], 95thPercentileLatency(us), 1487
[GET_VERTEX_COUNT], 99thPercentileLatency(us), 3659
[GET_VERTEX_COUNT], Return=OK, 946
[REMOVE_VERTEX_PROPERTY], Operations, 947
[REMOVE_VERTEX_PROPERTY], AverageLatency(us), 2308.2238648363254
[REMOVE_VERTEX_PROPERTY], MinLatency(us), 1202
[REMOVE_VERTEX_PROPERTY], MaxLatency(us), 70079
[REMOVE_VERTEX_PROPERTY], 50thPercentileLatency(us), 1674
[REMOVE_VERTEX_PROPERTY], 95thPercentileLatency(us), 3757
[REMOVE_VERTEX_PROPERTY], 99thPercentileLatency(us), 12847
[REMOVE_VERTEX_PROPERTY], Return=OK, 947
[GET_EDGES_WITH_LABEL], Operations, 919
[GET_EDGES_WITH_LABEL], AverageLatency(us), 9409.627856365614
[GET_EDGES_WITH_LABEL], MinLatency(us), 4312
[GET_EDGES_WITH_LABEL], MaxLatency(us), 44607
[GET_EDGES_WITH_LABEL], 50thPercentileLatency(us), 9231
[GET_EDGES_WITH_LABEL], 95thPercentileLatency(us), 9975
[GET_EDGES_WITH_LABEL], 99thPercentileLatency(us), 11703
[GET_EDGES_WITH_LABEL], Return=OK, 919
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 3
[CLEANUP], 50thPercentileLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 3
[SET_EDGE_PROPERTY], Operations, 927
[SET_EDGE_PROPERTY], AverageLatency(us), 2386.8824163969794
[SET_EDGE_PROPERTY], MinLatency(us), 1269
[SET_EDGE_PROPERTY], MaxLatency(us), 73855
[SET_EDGE_PROPERTY], 50thPercentileLatency(us), 1780
[SET_EDGE_PROPERTY], 95thPercentileLatency(us), 3431
[SET_EDGE_PROPERTY], 99thPercentileLatency(us), 10303
[SET_EDGE_PROPERTY], Return=OK, 927
[SET_VERTEX_PROPERTY], Operations, 937
[SET_VERTEX_PROPERTY], AverageLatency(us), 2239.1323372465313
[SET_VERTEX_PROPERTY], MinLatency(us), 1181
[SET_VERTEX_PROPERTY], MaxLatency(us), 166527
[SET_VERTEX_PROPERTY], 50thPercentileLatency(us), 1661
[SET_VERTEX_PROPERTY], 95thPercentileLatency(us), 2789
[SET_VERTEX_PROPERTY], 99thPercentileLatency(us), 8047
[SET_VERTEX_PROPERTY], Return=OK, 937
[GET_EDGE_COUNT], Operations, 963
[GET_EDGE_COUNT], AverageLatency(us), 949.8930425752856
[GET_EDGE_COUNT], MinLatency(us), 584
[GET_EDGE_COUNT], MaxLatency(us), 4959
[GET_EDGE_COUNT], 50thPercentileLatency(us), 832
[GET_EDGE_COUNT], 95thPercentileLatency(us), 1497
[GET_EDGE_COUNT], 99thPercentileLatency(us), 2935
[GET_EDGE_COUNT], Return=OK, 963